{
    "main": {
        "name": "Saidheeraj Poosarla",
        "description": "I am an aspiring software engineer with more than 2 years of professional experience in a dynamic and fast-paced environment. An enthusiastic learner with profound logical reasoning and programming skills...",
        "image": "profilepic.jpg",
        "bio": "I am an extremely determined software professional currently working as a Machine Learning Engineer at Arizona State University while pursuing Masters in Computer Science. I am comfortable with the programming languages of Python and Java. I am also familiar with the web development technologies of JavaScript, ReactJs, HTML, CSS and Bootstrap. I even have the experience of dealing with large datasets and building advanced machine learning models.",
        "email": "saidheeraj572@gmail.com",
        "phone": "+1 602-386-7432",
        "github": "https://github.com/Sai-Dheeraj-Poosarla",
        "project": "https://github.com/Sai-Dheeraj-Poosarla",
        "address": {
            "street": "1011 East Lemon Street",
            "city": "Tempe",
            "state": "Arizona"
        },
        "website": "https://sai-dheeraj-poosarla.github.io/",
        "resumedownload": "https://drive.google.com/file/d/1vXC7znsFDBAT3EKJSacheH-aAgKT3RE6/view?usp=sharing",
        "social": [
            {
                "name": "facebook",
                "url": "https://www.facebook.com/dheeraj.sai.5661",
                "className": "fa fa-facebook"
            },
            {
                "name": "twitter",
                "url": "https://twitter.com/Dheeraj91969262?s=09",
                "className": "fa fa-twitter"
            },
            {
                "name": "linkedin",
                "url": "https://www.linkedin.com/in/sai-dheeraj-poosarla-56b145141/",
                "className": "fa fa-linkedin"
            },
            {
                "name": "instagram",
                "url": "https://www.instagram.com/dheeraj572/",
                "className": "fa fa-instagram"
            },
            {
                "name": "github",
                "url": "https://github.com/Sai-Dheeraj-Poosarla",
                "className": "fa fa-github"
            }
        ]
    },
    "resume": {
        "skillmessage": "In addition to my most proficient skills below, I have also worked on and have experience on C, C++, Bash, HTML, CSS, Bootstrap, jQuery, PHP, Git, GitHub, BitBucket, MySQL, PostgreSQL, Google Colab, Jupyter, Eclipse, Salesforce, Tableau, Toad DataPoint, Snowflake, Einstein Analytics, Pardot, Monday.com, Slack, Deep Learning, Scala, Apache Spark, Excel and PowerPoint.",
        "education": [
            {
                "school": "Arizona State University",
                "degree": "Master of Science in Computer Science",
                "graduated": "January 2021 - December 2022",
                "description": "Current Cumulative GPA: 4.0 / 4.0"
            },
            {
                "school": "National Institute of Technology Karnataka, Surathkal",
                "degree": "Bachelor of Technology in Information Technology",
                "graduated": "July 2015 - May 2019",
                "description": "Cumulative GPA: 7.33 / 10.0"
            }
        ],
        "work": [
            {
                "company": "Arizona State University",
                "title": "Machine Learning Engineer",
                "years": "March 2021 - Present",
                "description1": "Predictive Modeling: Developed a classification model in Python using Machine Learning techniques to predict the open and click through rates of the marketing emails sent by the University which improved the rates by 4% and 6% respectively.",
                "description2": "Deep Learning: Predicted the conversion probability of leads using deep learning models with an accuracy of 88%, thereby, increasing the conversion rate by 2%.",
                "description3": "",
                "description4": ""
            },
            {
                "company": "ExxonMobil",
                "title": "Software Engineer",
                "years": "June 2019 - December 2020",
                "description1": "Web Development: Built highly responsive React components, incorporated new features and refined the code for the company’s internal skills assessment website which enhance user engagement by 7%. Developed single page applications and responsive UI using HTML5 grid layouts, CSS, JavaScript, Bootstrap and React.",
                "description2": "Customer Sentiment Analysis: Implemented a Natural Language Processing model with Python and SQL to achieve the sentiments of the unstructured customer feedback and integrated the results to a Tableau dashboard which enabled the sales managers to improve the customer satisfaction by 3%.",
                "description3": "Data Mining: Built predictive models to identify attributes related to delinquent customers and adjusted the sales limits for such customers accordingly.",
                "description4": "Forecasting: Predicted demand for ExxonMobil Chemicals by developing forecasting models in Python that helped in storage optimization across different warehouses."

            },
            {
                "company": "Trashin Recycling Private Limited",
                "title": "Full Stack Developer",
                "years": "May 2018 - July 2018",
                "description1": "Front-end Web Development: Built the UI design and prototype for the company’s web application and developed highly interactive components using React concepts which improved the brand name of the organization by 3%. Translated designs and wireframes into highly optimized code using JavaScript with React.js library.",
                "description2": "",
                "description3": "",
                "description4": ""
            }
        ],
        "skills": [
            {
                "name": "Python",
                "level": "75%"
            },
            {
                "name": "ReactJs",
                "level": "65%"
            },
            {
                "name": "SQL",
                "level": "70%"
            },
            {
                "name": "Java",
                "level": "60%"
            },
            {
                "name": "Machine Learning",
                "level": "70%"
            },
            {
                "name": "Natural Language Processing",
                "level": "55%"
            }
        ]
    },
    "portfolio": {
        "projects": [
            {
                "title": "Geospatial hotspot analysis of NYC taxi trip dataset",
                "category": "Developed spatial queries using Scala, SQL, SparkSQL and Apache Spark on a firm’s database containing geographic data and the real time location data of their customers. Defined and implemented hot cell and hot zone analyses which provides useful actionable insights about the firm’s customers.",
                "image": "project5.jpg",
                "url": "https://www.google.com"
            },
            {
                "title": "Space Invaders Game",
                "category": "Built a popular game using Java and Swing toolkit which involved creating a graphical user interface, populating it with game pieces, enabling movement and shooting capabilities in the game pieces, detecting any hits, and calculating the score.",
                "image": "project3.jpg",
                "url": "https://www.google.com"
            },
            {
                "title": "Video Captioning with Attention-Based LSTM and Semantic Consistency",
                "category": "Developed a novel end-to-end framework named aLSTMs, an attention-based LSTM model, to capture crucial features of a video and convert them into human understandable sentences.",
                "image": "project1.jpg",
                "url": "https://www.google.com"
            },
            {
                "title": "Banking Application",
                "category": "Developed a banking application using conditions and locks in Java to ensure thread safety without compromising on data integrity. ",
                "image": "project4.jpg",
                "url": "https://www.google.com"
            }

        ]
    }
}
